In [1]:
import mysql.connector as connection

try:
    mydb=connection.connect(host="localhost",user="root",passwd="123456",use_pure=True)
    
    query="SHOW DATABASES"
    
    cursor=mydb.cursor()
    cursor.execute(query)
    print(cursor.fetchall())
    
except Exception as e:
    mydb.close()
    print(str(e))

[('gla_1',), ('glass',), ('ineuron',), ('information_schema',), ('mysql',), ('performance_schema',), ('sakila',), ('sys',), ('test',), ('testsudhineuron',), ('world',)]

In [15]:
cursor.execute("SHOW DATABASES")

In [16]:
cursor.fetchall()

[('gla_1',),
 ('glass',),
 ('ineuron',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('testsudhineuron',),
 ('world',)]

In [65]:
cur.execute("show databases")

In [66]:
cur.fetchall()

[('gla_1',),
 ('glass',),
 ('ineuron',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sumay123',),
 ('sys',),
 ('test',),
 ('testsudhineuron',),
 ('world',)]

In [42]:
res=cur.fetchall()

In [37]:
res

[('gla_1',),
 ('glass',),
 ('ineuron',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('testsudhineuron',),
 ('world',)]

In [32]:
res[1]

('glass',)

In [35]:
res[1][0]

'glass'

In [36]:
for i in res:
    print(i)

('gla_1',)
('glass',)
('ineuron',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('test',)
('testsudhineuron',)
('world',)

In [47]:
cur.execute("show databases")

## Creating databases

In [63]:
conn=connection.connect(host="localhost",database="sumay123",user="root",passwd="123456",use_pure=True)

In [64]:
cur=conn.cursor()

In [68]:
cur.execute("show databases")

In [69]:
cur.fetchall()

[('gla_1',),
 ('glass',),
 ('ineuron',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sumay123',),
 ('sys',),
 ('test',),
 ('testsudhineuron',),
 ('world',)]

In [54]:
conn.is_connected()

True

### Now creating a table inside sumay123 database

In [67]:
cur.execute('create table test(x1 INT(5),x2 VARCHAR(20),x3 DATE)')

In [71]:
conn.close()

### as i have closed the databases so i have to do all this thing again

In [74]:
conn=connection.connect(host="localhost",database="sumay123",user="root",passwd="123456",use_pure=True)

In [75]:
cur=conn.cursor()

In [76]:
cur.execute("insert into test values(1452,'sumay','2023-03-15')")

In [82]:
cur.fetchall()

[]

In [81]:
cur.execute("use sumay123")

In [83]:
conn.commit() # to save the data we pass we have to use commit with our connection variable

In [84]:
cur.execute("insert into test values(1112,'kumar','2023-03-15')")

In [85]:
conn.commit()

In [86]:
cur.execute('select * from test')

In [87]:
cur.fetchall()

[(1452, 'sumay', datetime.date(2023, 3, 15)),
 (1112, 'kumar', datetime.date(2023, 3, 15))]

In [88]:
cur.execute('insert into test values(1113,"ram","2023-03-15")')
cur.execute('insert into test values(1114,"shyam","2023-03-15")')

In [89]:
conn.commit()

In [99]:
cur.execute("select * from test")

In [97]:
cur.fetchall()

[(1452, 'sumay', datetime.date(2023, 3, 15)),
 (1112, 'kumar', datetime.date(2023, 3, 15)),
 (1113, 'ram', datetime.date(2023, 3, 15)),
 (1114, 'shyam', datetime.date(2023, 3, 15))]

In [100]:
for i in cur.fetchall():
    print(i)

(1452, 'sumay', datetime.date(2023, 3, 15))
(1112, 'kumar', datetime.date(2023, 3, 15))
(1113, 'ram', datetime.date(2023, 3, 15))
(1114, 'shyam', datetime.date(2023, 3, 15))

In [110]:
cur.execute("select x1,x2 from test")

In [111]:
for i in cur.fetchall():
    print(i)

(1452, 'sumay')
(1112, 'kumar')
(1113, 'ram')
(1114, 'shyam')

In [112]:
cur.fetchall()

[]

In [113]:
import pandas as pd

In [114]:
pd.read_sql("select * from sumay123.test",conn)

C:\Users\win11\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     x1     x2          x3
0  1452  sumay  2023-03-15
1  1112  kumar  2023-03-15
2  1113    ram  2023-03-15
3  1114  shyam  2023-03-15

In [116]:
pd.read_sql("select x1,x2 from test",conn)

C:\Users\win11\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     x1     x2
0  1452  sumay
1  1112  kumar
2  1113    ram
3  1114  shyam

In [122]:
a=pd.read_sql("select * from sumay123.test",conn)

C:\Users\win11\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [123]:
a

     x1     x2          x3
0  1452  sumay  2023-03-15
1  1112  kumar  2023-03-15
2  1113    ram  2023-03-15
3  1114  shyam  2023-03-15

In [124]:
a.to_csv("mydata.csv")

### Now creating another table on same database sumay123 and importing a file

In [117]:
conn

In [119]:

conn.is_connected()

True

In [120]:
cur.execute("create table mydata (n1 int(20), n2 varchar(25), n3 date)")

In [121]:
cur.fetchall()

[]

In [126]:
data=pd.read_csv("glasss.txt")

In [130]:
data.head(3)

   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.00  0.00.1  1.1
0  2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83   0.0     0.0    1
1  3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78   0.0     0.0    1
2  4  1.51766  13.21  3.69  1.29  72.61  0.57  8.22   0.0     0.0    1

In [132]:
data1=pd.read_csv("mydata.csv")
data1.head()

   Unnamed: 0    x1     x2          x3
0           0  1452  sumay  2023-03-15
1           1  1112  kumar  2023-03-15
2           2  1113    ram  2023-03-15
3           3  1114  shyam  2023-03-15

In [138]:
data.to_sql("mydata",con=conn)

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': Not all parameters were used in the SQL statement

In [139]:
cur

In [144]:
cur.execute("create table sumay123.glass (index int(10), RI float(10,5), na float(10,5), mg float(10,5) ,ai float(10,5),ab float(10,5),ac float(10,5) ,ad float(10,5), bb float(10,5), cc float(10,5), dd int(5)) ")

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'int(10), RI float(10,5), na float(10,5), mg float(10,5) ,ai float(10,5),ab float' at line 1